app/views/lists/show.html.erb

SELECT "todos".* FROM "todos" WHERE "todos"."list_id" = $1  [["list_id", 1]]
---
<h1><%= @list.name %></h1>
<% @list.todos.each do |todo| %>