app/controllers/lists_controller.rb

  def show
    @list = List.find params[:id]
---
SELECT  "lists".* FROM "lists" WHERE "lists"."id" = $1 LIMIT 1  [["id", 1]]

  def create
    @list = List.new list_params
    if @list.save
---
INSERT INTO "lists" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Saturday"], ["created_at", "2015-03-17 18:16:33.949890"], ["updated_at", "2015-03-17 18:16:33.949890"]]