app/controllers/todos_controller.rb

SELECT  "todos".* FROM "todos" WHERE "todos"."id" = $1 LIMIT 1  [["id", 1]]
---
  def edit
    @todo = Todo.find params[:id]

SELECT  "todos".* FROM "todos" WHERE "todos"."id" = $1 LIMIT 1  [["id", 1]]
DELETE FROM "todos" WHERE "todos"."id" = $1  [["id", 1]]
---
  def destroy
    todo = Todo.find params[:id]
    todo.destroy